{
    "Special": "This group includes powerful space telescopes like Hubble and James Webb, as well as crewed missions like the International Space Station (ISS). Unlike other satellites, they don’t just orbit Earth—they observe distant galaxies or support astronauts in space. These structures are large, expensive, and crucial for both science and human exploration. They help us study the universe and test technologies for future missions.",
    "Starlink": "Starlink is a massive network of small satellites launched by SpaceX to provide high-speed internet across the globe, especially in remote areas. These satellites orbit Earth at low altitudes and are often seen moving in straight lines. As of now, thousands are active, forming a 'constellation' in space. Their primary goal is to make internet access faster, more reliable, and available anywhere on Earth.",
    "Science": "Science satellites are built to collect data about space, Earth, or physics experiments in microgravity. They monitor things like cosmic radiation, solar activity, magnetic fields, or environmental conditions. Agencies like NASA or ESA use them to better understand how our planet and the universe work. Their data supports everything from climate studies to understanding black holes.",
    "GPS": "GPS (Global Positioning System) satellites allow us to determine exact positions on Earth using our phones, cars, and airplanes. They form a network of over 30 satellites constantly sending timing signals to receivers on the ground. Originally developed by the U.S. military, GPS is now used globally for navigation, tracking, and even weather forecasting. Without them, location services wouldn’t function.",
    "Weather": "These satellites monitor Earth's atmosphere to track clouds, storms, temperatures, and natural disasters. They help meteorologists forecast the weather and detect dangerous events like hurricanes or typhoons early. Most orbit in polar or geostationary paths to provide continuous global or regional coverage. Thanks to them, we get accurate weather reports and emergency warnings.",
    "Above": "This special category shows Starlink satellites currently above your location, rising in the sky from 70° to 140° elevation—almost directly overhead. These satellites are ideal for real-time tracking and skywatching since they often appear like bright moving dots. This straight-line formation is part of the Starlink internet grid. Watching them can feel like observing a moving 'train of stars; crossing the night sky."
}